BankXml/MT102_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns4:getMt102Request xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://strukturaRtgsNaloga.xml.com" xmlns:ns4="http://mt102.xml.com" xmlns:ns5="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>Dgk8EkI2eiLTzfYQQ8ob62cTCUCCBRIVdEvtALlv8dzLkoa5OWJSA/rA8hWUNEZtGe1x61QMTs47&#13;
6G3LHM/FUWMB6pIzq0Pm46Ter/lRAtjKCOy2/+dHo6sOAzaLu0WakIXbzksAEZehXjnFKZgZZ3wE&#13;
/SzSJqktsJLdjrNLV/WNrikAYLJHhNL9QUWGR1cWAwRv3MtHZX8bnjtvgm4lDVcRZjK9JA0R+eaS&#13;
feRxmJ0pxqJvErpHgZy4ypXUK2hVZ1iqpfBcy76kQg2rp9BpjMEcdz4voAJTCy3bL8GcF+I1HchK&#13;
vsKkHXKhq2KQp2o2MiuSId4mKruRU57iDCQO0g==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>FxNKqOKuyIORgRyWZT7A96W2hbiYvkY+eRx20HcRrrgKCayGN1ccMQmKTDCnEo2Z6PRwET2YQj7C&#13;
u3acxKHbDD3D092cZ8rNu/BBELpLcK88zQ4MkcyuyLIvYCloWCcjNWiT63fbRr8urX+3Dqt6fVAy&#13;
XZ/MjME03Ff142KcZfIoCLGoCOU4xXsy4IDajRyBTL33YP2K+fLInOW6nNmxfU50IX1QJiqeCd5K&#13;
jU/w9cOBMXkxQzgJvxp7uHoYqt4wpSadAOROx/K6io3PHx9dJFw3FLgwU+GF8mUEz/9GRCTcNtPd&#13;
p8ncbDYVVagfDZsMmxLYw5HV6HQXBDgXN1R2Gw1wyi4R5Avov+6uC++2BAzrEDKflNeDz8yvrB8F&#13;
YiXh9QweSPUViRw70foZH3OJGxEZmgN+qXurhpi5vmX6fU1vbuscVgVVh/3aEEBTKPBkLVwX3vPr&#13;
cxHZ3OTSKpahzahLVAztlX1Tzdhxsfskh5Om2UqwgTHvKpXIuMKEqsKymukvK6l0icfYF22LZ2fg&#13;
ri9uWojBFaJfA0voREFTW9895ifarKyky+YLhmXCpxE9tugZ0QXJ9A0aJDCfdOsodQNoWMfiyGlA&#13;
xnzSpTs/sdnoC9dlVb8FOlYN/5QZd5zRCbvzNbShZzYjbd2mgm44wFpDCBxgReoVXV6ZcYDZBeJj&#13;
uTsQlxMOhzbHlpZ8bWnIp4jQxHq9WwXOG7v/5IKk+pKxmrM0DS+dU9NvrfvWkL7YMkfPGxYnyeKq&#13;
eXkjbeDkwdXUAa61+o0UC1wBteeQFjz9NkrIrHOngyhNouCSOYRnI2sgKNyaJbjGS79nBQ0i6mHI&#13;
Csw57Gwbc47eileXXXbKVHH3qVUGlC5qlb6zT0AU8zuBaxtKYLA/Wv7rVYCCTt137e9gryGocIl8&#13;
coOAJSuluGqc4A0i6rOWQOmzK/zi8H/anB5w4NWvbPZyiowDMdnlyncnhz7gQyTLGw9Qaevt/4xo&#13;
86wiKCI5d13UOsl1woIEqf/sevhv056FOQ8m8LHuZTDJz5EmleLPObHbVvrP+0ScBRuXO53VwCMb&#13;
1dZZ/T6XIys7S5pQDVGWmxHyA/lpfP9y+uZaMQA6CFR8Tj1OBbji5wyS1wiMsq6KZrGV4gp1M9Ws&#13;
kgKUsQxvBMucEqELnhR7duZfxxxjsvfWWkHHCbn3OReBRb5Z/aD/9mDKlUPMswUtPdkUl0No5nVD&#13;
NcCJg3w3wigi1+disrZLGBoDdCg41xtK070x274HbFxbPQ1M/OzvRTSUdAwj4U0kDcyKS2iKrLZ3&#13;
EmSvwLyTEEzsVbQLth5J7OrYFWKgEp6+75MMKGGXIf3FTO0hG2vrOY2O1SiG81ptRiFdoLi/+Yvl&#13;
auhZnACmXIR3YCGscliHepzfCY663vlfH1ocyBPL51yt9q/Zb9JZVqpnbYeKwI9A6kCL+7qUZqaX&#13;
S1hTAw4Y2hcb2fZYg+fTvM891+xXowDyyqg15hHtnicisnEnDu1z7afae5Htm7r7g6M+Mq9QUY5b&#13;
w8U6it+zB6XrxbvaiNOpsnC2VTkOHqOFFi59xvlyiF8TZIjxvfRF/WzE0xzyC/YZl0bkHlNCe4eC&#13;
k+BdZiT2RhIimaT+s2PBGSLMWCQ0EQznozKII7OAtp4aTXl5xZGvM4rM6aNlHiFmVIxG</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns4:getMt102Request></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>0ueNBTbYnLW2WIDok2Z1jiSICcQ=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
Ba+dRnvi6KAf6j0vhKTinzMjmQ3icgDGI4EwGpA5f5NL1peuZW9/x6JMo8/fH90QnH2fbSdcx5o8&#13;
iGHd9YEu/oQqlA1QvCc9Hw8Tjo7cusfP8AUFx+FuX0+c+EyQrPy03wj41qTg+yv8Zf8QFDXypAHe&#13;
boYF5JFYEuIQAF5+UQ7VVsfTYQitdXS4R+vE1VyDK/SjUkai6L+j4Oh5bBO4xqvRS+zFoEuKOztD&#13;
xlHVypFjdGtsGrNmHaLGIJvyyi9cv5xewlMfUZKvkwggU3+cMFgGpJkXDJ6QeJBwgNEB8+poSq2W&#13;
8e/bRCXZoVvMndDhSMqeo3aKZkox7WMS/qK97g==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
iYFqE4e3bUjAttedcKZSAisg5+YICC8Yf0MmjWxsj5XjlN5kZN6T1RC6zXYH7U2nokaxjGxEeKvq&#13;
gvCJfwiBo+t2lGFyaOU3dietqZWr0scIpm0rVoazZPgCzo3PPK1VBWpyOA7/1UZpPJYxIoQq0ZrR&#13;
NGJPIKLff/UQtyjgf1AQZN7+6Ey5MKfG0NNQtvoO8AgL0CGe81+ziZ7GjbIR11OodRAkFxSz7xeb&#13;
DWOWK5L1jDwPPkyoFpyybsD45Vld/1z0M6kDFzyCm/ha37vqGBBGSKudUVztnMY/jwo9ja3Yd93Q&#13;
3Pe2lZfRAj5qykiOd8WEq4KDJ7/zWU1f0nsu5Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDoDCCAoigAwIBAgIEWUhQxDANBgkqhkiG9w0BAQsFADCBlDEWMBQGA1UEAwwNTmFyb2RuYSBi&#13;
YW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2RuYSBiYW5rYTEMMAoG&#13;
A1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEaMBgGCgmSJomT8ixk&#13;
AQEMCjE0OTc5MTE0MzgwHhcNMTcwNjE5MDAwMDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQD&#13;
DAdCYW5rYSBBMRAwDgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3Ji&#13;
MRowGAYJKoZIhvcNAQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIw&#13;
ggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCJgWoTh7dtSMC2151wplICKyDn5ggILxh/&#13;
QyaNbGyPleOU3mRk3pPVELrNdgftTaeiRrGMbER4q+qC8Il/CIGj63aUYXJo5Td2J62plavSxwim&#13;
bStWhrNk+ALOjc88rVUFanI4Dv/VRmk8ljEihCrRmtE0Yk8got9/9RC3KOB/UBBk3v7oTLkwp8bQ&#13;
01C2+g7wCAvQIZ7zX7OJnsaNshHXU6h1ECQXFLPvF5sNY5YrkvWMPA8+TKgWnLJuwPjlWV3/XPQz&#13;
qQMXPIKb+Frfu+oYEEZIq51RXO2cxj+PCj2Nrdh33dDc97aVl9ECPmrKSI53xYSrgoMnv/NZTV/S&#13;
ey7lAgMBAAGjEzARMA8GA1UdEwEB/wQFMAMBAf8wDQYJKoZIhvcNAQELBQADggEBAG97A295MjBs&#13;
W9KAIx7/VlBabr8edSQbwNqaLPJLT5LeXqrCTaBeBstdUnbxRCduSIoV96h3+ogy22lBm5viOXER&#13;
psHpIRtjoSogXu79aPwGuXfh9ZwcJ0snkOpAC1eITJK2j1gOzT/dj8SY5RP7ptosw0o6HwgzyljK&#13;
O1eNN5AunHsAjCkJMn1eyJJW8bZkjp3HajxoHM5Y7dGc3GYi018+StfkjZC51kj4ZrjRsklhIrrC&#13;
cbKkMsD/PPaZUN96KbMev6exKS3gXxBkyi/4TKpbNblT60MheU7fWgOodF9bswi0x31dftQibjms&#13;
lxmeTI40cje1sxblOwNPGNOc0OA=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>